Initializing gui preferences from file  /home/isa12_2021_2022/.synopsys_dv_prefs.tcl
dc_shell> gui_start
4.1
design_vision> sh mkdir WORK
design_vision> define_design_lib WORK -path ./WORK
design_vision> analyze -library WORK -format vhdl {{/home/isa12_2021_2022/Desktop/Lab3_ABS/src control hazard/Register.vhd} {/home/isa12_2021_2022/Desktop/Lab3_ABS/src control hazard/ControlHazardUnit2.vhd} {/home/isa12_2021_2022/Desktop/Lab3_ABS/src control hazard/ControlHazardUnit1.vhd} {/home/isa12_2021_2022/Desktop/Lab3_ABS/src control hazard/ControlHazardUnit.vhd}}
Running PRESTO HDLC
Compiling Entity Declaration REG
Compiling Architecture BEH of REG
Compiling Entity Declaration CONTROLHAZARDUNIT2
Compiling Architecture BEH of CONTROLHAZARDUNIT2
Compiling Entity Declaration CONTROLHAZARDUNIT1
Compiling Architecture BEH of CONTROLHAZARDUNIT1
Compiling Entity Declaration CONTROLHAZARDUNIT
Compiling Architecture BEH of CONTROLHAZARDUNIT
Presto compilation completed successfully.
Loading db file '/software/dk/nangate45/synopsys/NangateOpenCellLibrary_typical_ecsm_nowlm.db'
Loading db file '/software/synopsys/syn_current_64.18/libraries/syn/dw_foundation.sldb'
design_vision> elaborate ControlHazardUnit -arch BEH -lib WORK
Loading db file '/software/synopsys/syn_current_64.18/libraries/syn/gtech.db'
Loading db file '/software/synopsys/syn_current_64.18/libraries/syn/standard.sldb'
  Loading link library 'NangateOpenCellLibrary'
  Loading link library 'gtech'
Running PRESTO HDLC
Presto compilation completed successfully.
Elaborated 1 design.
Current design is now 'ControlHazardUnit'.
Information: Building the design 'ControlHazardUnit1'. (HDL-193)
Warning:  /home/isa12_2021_2022/Desktop/Lab3_ABS/src control hazard/ControlHazardUnit1.vhd:46: DEFAULT branch of CASE statement cannot be reached. (ELAB-311)
Warning:  /home/isa12_2021_2022/Desktop/Lab3_ABS/src control hazard/ControlHazardUnit1.vhd:64: DEFAULT branch of CASE statement cannot be reached. (ELAB-311)

Statistics for case statements in always block at line 44 in file
        '/home/isa12_2021_2022/Desktop/Lab3_ABS/src control hazard/ControlHazardUnit1.vhd'
===============================================
|           Line           |  full/ parallel  |
===============================================
|            46            |    auto/auto     |
===============================================

Statistics for case statements in always block at line 62 in file
        '/home/isa12_2021_2022/Desktop/Lab3_ABS/src control hazard/ControlHazardUnit1.vhd'
===============================================
|           Line           |  full/ parallel  |
===============================================
|            64            |    auto/auto     |
===============================================
Presto compilation completed successfully.
Information: Building the design 'ControlHazardUnit2'. (HDL-193)
Warning:  /home/isa12_2021_2022/Desktop/Lab3_ABS/src control hazard/ControlHazardUnit2.vhd:48: DEFAULT branch of CASE statement cannot be reached. (ELAB-311)
Warning:  /home/isa12_2021_2022/Desktop/Lab3_ABS/src control hazard/ControlHazardUnit2.vhd:65: DEFAULT branch of CASE statement cannot be reached. (ELAB-311)

Statistics for case statements in always block at line 45 in file
        '/home/isa12_2021_2022/Desktop/Lab3_ABS/src control hazard/ControlHazardUnit2.vhd'
===============================================
|           Line           |  full/ parallel  |
===============================================
|            48            |    auto/auto     |
===============================================

Statistics for case statements in always block at line 63 in file
        '/home/isa12_2021_2022/Desktop/Lab3_ABS/src control hazard/ControlHazardUnit2.vhd'
===============================================
|           Line           |  full/ parallel  |
===============================================
|            65            |    auto/auto     |
===============================================
Presto compilation completed successfully.
Information: Building the design 'Reg'. (HDL-193)

Inferred memory devices in process
        in routine Reg line 12 in file
                '/home/isa12_2021_2022/Desktop/Lab3_ABS/src control hazard/Register.vhd'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|    DATA_OUT_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
1
Current design is 'ControlHazardUnit'.
design_vision> uniquify
Information: Uniquified 2 instances of design 'Reg'. (OPT-1056)
1
Current design is 'ControlHazardUnit'.
design_vision> link
  Linking design 'ControlHazardUnit'
  Using the following designs and libraries:
  --------------------------------------------------------------------------
  * (5 designs)               /home/isa12_2021_2022/Desktop/Lab3_ABS/syn/ControlHazardUnit.db, etc
  NangateOpenCellLibrary (library) /software/dk/nangate45/synopsys/NangateOpenCellLibrary_typical_ecsm_nowlm.db
  dw_foundation.sldb (library) /software/synopsys/syn_current_64.18/libraries/syn/dw_foundation.sldb

1
design_vision> compile
Information: Evaluating DesignWare library utilization. (UISN-27)

============================================================================
| DesignWare Building Block Library  |         Version         | Available |
============================================================================
| Basic DW Building Blocks           | O-2018.06-DWBB_201806.4 |     *     |
| Licensed DW Building Blocks        | O-2018.06-DWBB_201806.4 |           |
============================================================================



  Beginning Pass 1 Mapping
  ------------------------
  Processing 'Reg_0'
  Processing 'ControlHazardUnit2'
  Processing 'ControlHazardUnit1'
  Processing 'ControlHazardUnit'

  Updating timing information
Information: Updating design information... (UID-85)
Information: Design 'ControlHazardUnit' has no optimization constraints set. (OPT-108)

  Beginning Mapping Optimizations  (Medium effort)
  -------------------------------
  Structuring 'Reg_0'
  Mapping 'Reg_0'
  Structuring 'Reg_1'
  Mapping 'Reg_1'
  Structuring 'ControlHazardUnit2'
  Mapping 'ControlHazardUnit2'
  Structuring 'ControlHazardUnit1'
  Mapping 'ControlHazardUnit1'
  Structuring 'ControlHazardUnit'
  Mapping 'ControlHazardUnit'

                                  TOTAL                                      
   ELAPSED            WORST NEG   SETUP    DESIGN                            
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:07      23.1      0.00       0.0       0.0                          
    0:00:08      23.1      0.00       0.0       0.0                          
    0:00:08      23.1      0.00       0.0       0.0                          
    0:00:08      23.1      0.00       0.0       0.0                          
    0:00:08      23.1      0.00       0.0       0.0                          
    0:00:08      23.1      0.00       0.0       0.0                          
    0:00:08      23.1      0.00       0.0       0.0                          
    0:00:08      23.1      0.00       0.0       0.0                          
    0:00:08      23.1      0.00       0.0       0.0                          
    0:00:08      23.1      0.00       0.0       0.0                          
    0:00:08      23.1      0.00       0.0       0.0                          
    0:00:08      23.1      0.00       0.0       0.0                          



  Beginning Delay Optimization Phase
  ----------------------------------

                                  TOTAL                                      
   ELAPSED            WORST NEG   SETUP    DESIGN                            
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:08      23.1      0.00       0.0       0.0                          
    0:00:08      23.1      0.00       0.0       0.0                          
    0:00:08      23.1      0.00       0.0       0.0                          


  Beginning Area-Recovery Phase  (cleanup)
  -----------------------------

                                  TOTAL                                      
   ELAPSED            WORST NEG   SETUP    DESIGN                            
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:08      23.1      0.00       0.0       0.0                          
    0:00:08      23.1      0.00       0.0       0.0                          
    0:00:08      23.1      0.00       0.0       0.0                          
    0:00:08      23.1      0.00       0.0       0.0                          
    0:00:08      23.1      0.00       0.0       0.0                          
    0:00:08      23.1      0.00       0.0       0.0                          
    0:00:08      23.1      0.00       0.0       0.0                          
    0:00:08      23.1      0.00       0.0       0.0                          
    0:00:08      23.1      0.00       0.0       0.0                          
    0:00:08      23.1      0.00       0.0       0.0                          
    0:00:08      23.1      0.00       0.0       0.0                          
Loading db file '/software/dk/nangate45/synopsys/NangateOpenCellLibrary_typical_ecsm_nowlm.db'


Note: Symbol # after min delay cost means estimated hold TNS across all active scenarios 


  Optimization Complete
  ---------------------
1
Current design is 'ControlHazardUnit'.
design_vision> check_design
 
****************************************
check_design summary:
Version:     O-2018.06-SP4
Date:        Thu Feb  3 18:36:50 2022
****************************************

                   Name                                            Total
--------------------------------------------------------------------------------
Inputs/Outputs                                                      1
    Shorted outputs (LINT-31)                                       1
--------------------------------------------------------------------------------

Warning: In design 'ControlHazardUnit2', output port 'SEL_MUX_PC' is connected directly to output port 'SEL_MUX_INSTR'. (LINT-31)
1
design_vision> ungroup -all -flatten
Information: Updating graph... (UID-83)
1
Current design is 'ControlHazardUnit'.
design_vision> change_names -hierarchy -rules verilog
1
design_vision> write -f verilog -hierarchy -output ../netlist/hzcontrol.v
Writing verilog file '/home/isa12_2021_2022/Desktop/Lab3_ABS/netlist/hzcontrol.v'.
1
design_vision> check_design
1
design_vision> 
